def n1():
    a={"Россия":"Москва","Великобритания":"Лондон","Китай":"Пекин","Италия":"Рим","Египет" :"Каир"}
    #a#
    for k in a:
        print(k,"-",a[k])
    #b#
    print(a.get(input("Введите страну: ")))
    #c#
    print("По алфавиту")
    sr=[]
    for k in a.keys():
        sr.append(k)
    sr.sort()
    for k in sr:
        print(k,"-",a[k])

def n2():
    a = {"А": "1", "В": "1", "Е": "1", "И": "1","Н": "1" , "О": "1", "Р": "1", "С": "1","Т": "1", "Д": "2", "К": "2", "Л": "2", "М": "2", "П": "2", "У": "2", "Г": "3", "Ё": "3", "Я": "3", "Б": "3", "Ь": "3", "Й": "4", "Ы": "4", "Ж": "5", "З": "5", "Х": "5", "Ц": "5", "Ч": "5", "Ш": "8", "Э": "8", "Ю": "8", "Ф": "10", "Щ": "10", "Ъ": "10"}
    sl=input("Введите слово: ")
    sl=sl.upper()
    sl1=[]
    for i in  sl:
        sl1.append(a.get(i))
    s=0
    for i in sl1:
        s=s+int(i)
    print("Слово стоит: ", s)

def n3():
    a= {"Екимова":["японский","китайский"],"Идрисова":["английский","испанский"],"Зотова":["корейский","английский","итальянский"],"Софронова":["английский","китайский"],"Нгуен":["английский","вьетнамский"]}
    lang=[]
    chi=[]
    for i in  a:
        b=a.get(i)
        for j in b:
            lang.append(j)
            if j=="китайский":
                chi.append(i)
    lang=set(lang)
    lang=list(lang)
    lang.sort()
    print("Количество языков: ", len(lang))
    print(lang)
    print("Знают Китайский: ",chi)
n3()